Процедура ПриЗагрузкеБиблиотеки(Знач Путь, СтандартнаяОбработка, Отказ)
	
	СтандартнаяОбработка = Ложь;
	ДобавитьМакет(ОбъединитьПути(Путь, "Перечисления.json"), "/Макеты/Перечисления");
	ДобавитьМакет(ОбъединитьПути(Путь, "ОписаниеФорматаChangeLog.md"), "/Макеты/ОписаниеФорматаChangeLog");
	ДобавитьМакет(ОбъединитьПути(Путь, "ОсобенностиChangeLog.md"), "/Макеты/ОсобенностиChangeLog");
	ДобавитьМакет(ОбъединитьПути(Путь, "КонтрольнаяСумма.md"), "/Макеты/КонтрольнаяСумма");
	ДобавитьМакет(ОбъединитьПути(Путь, "Обфускация.md"), "/Макеты/Обфускация");

КонецПроцедуры