// Сведения о внешней обработке.
// 
// Возвращаемое значение:
//  ДанныеРегистрации - Структура - Список сведений о внешней обработке для добавления в справочник БСП.
//
Функция СведенияОВнешнейОбработке() Экспорт

	Описание = "Заполнение описания номенклатуры с помощью ChatGPT в ERP 2 / УТ 11 / КА 2";

	ДанныеРегистрации = Новый Структура();
	ДанныеРегистрации.Вставить("Наименование", Описание);
	ДанныеРегистрации.Вставить("БезопасныйРежим", Ложь);
	ДанныеРегистрации.Вставить("Версия", "1.0.0.2"); 
	ДанныеРегистрации.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	ДанныеРегистрации.Вставить("Информация", "Обработка для заполнения описания номенклатуры с помощью ChatGPT");
	ДанныеРегистрации.Вставить("Вид", "ДополнительнаяОбработка");

	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	ДобавитьКоманду(ТаблицаКоманд, "ВыполнитьЗапросChatGPT", "ВызовСерверногоМетода", 
		"Регламентное заполнение описания товаров");	
	ДобавитьКоманду(ТаблицаКоманд, "ОткрытьОбработку", "ОткрытиеФормы", "Открыть основную форму");
	
	Назначения = Новый Массив;
	Назначения.Добавить("Подсистема.Продажи");
	Назначения.Добавить("Подсистема.Склад");
	Назначения.Добавить("Справочник.Номенклатура");
	
	ДанныеРегистрации.Вставить("Назначение", Назначения);
	ДанныеРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ДанныеРегистрации;

КонецФункции