// Сведения о внешней обработке.
// 
// Возвращаемое значение:
//  ДанныеРегистрации - Структура - Список сведений о внешней обработке для добавления в справочник БСП.
//
Функция СведенияОВнешнейОбработке() Экспорт

	Описание = "Заполнение описания номенклатуры с помощью ChatGPT в ERP 2 / УТ 11 / КА 2";

	ДанныеРегистрации = Новый Структура();
	ДанныеРегистрации.Вставить("Наименование", Описание);
	ДанныеРегистрации.Вставить("БезопасныйРежим", Ложь);
	ДанныеРегистрации.Вставить("Версия", "1.0.0.2"); 
	ДанныеРегистрации.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	
	Возврат ДанныеРегистрации;

КонецФункции