// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.ДобавитьКоманду("sourcetoxml1c",
		"Экспорт проекта EDT в формат XML-выгрузки 1С (используя ring)",
		Новый EdtSourceToXML1C());

	Команда.ДобавитьКоманду("versionconfig",
		"Возвращает в консоль версию конфигурацию из проекта EDT получаемую из исходного кода",
		Новый EdtVersionConfig());
	
КонецПроцедуры // ОписаниеКоманды()

// Обработчик выполнения команды
//
// Параметры:
//   КомандаПриложения - КомандаПриложения - Выполняемая команда
//
Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт
    
    КомандаПриложения.ВывестиСправку();
    
КонецПроцедуры