#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбщий());

	Команда.Опция("name extension n", "",
		"Имя удаляемого расширения. Указывается либо --name, либо --all")
		.ТСтрока();

	Команда.Опция("all", "",
		"Удалить все расширения. Указывается либо --name, либо --all")
		.ТБулево();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбщий());
	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ИмяРасширения = ЧтениеОпций.ЗначениеОпции("name");
	ПараметрыКоманды.Вставить("ИмяРасширения", ?(ЗначениеЗаполнено(ИмяРасширения), ИмяРасширения, ""));
	ПараметрыКоманды.Вставить("Все", ЧтениеОпций.ЗначениеОпции("all") = Истина);

	Если ЗначениеЗаполнено(ПараметрыКоманды.ИмяРасширения) = ПараметрыКоманды.Все Тогда
		ОбщегоНазначения.ЗавершениеРаботыОшибка("Укажите что-то одно: --name или --all");
	КонецЕсли;

	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды, "Ошибка удаления расширения");

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	Если ПараметрыКоманды.Все Тогда
		МенеджерIbcmd.УдалитьВсеРасширения();
	Иначе
		МенеджерIbcmd.УдалитьРасширение(ПараметрыКоманды.ИмяРасширения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
