#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбщий());

	Команда.Опция("name extension n", "",
		"Имя расширения (обязательный)")
		.ТСтрока();

	Команда.Опция("path to p", "",
		"Каталог, куда сохранить исходники расширения в формате XML 1С. "
		+ "Важно! Каталог будет очищен в процессе работы команды (обязательный)")
		.ТСтрока();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбщий());
	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПараметрыКоманды.Вставить("ИмяРасширения", ЧтениеОпций.ЗначениеОпции("name", Истина));
	ПараметрыКоманды.Вставить("Каталог", ЧтениеОпций.ЗначениеОпции("path", Истина));

	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды,
		СтрШаблон("Ошибка выгрузки расширения %1 в XML", ПараметрыКоманды.ИмяРасширения));

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	ФайловыеОперации.ОбеспечитьПустойКаталог(ПараметрыКоманды.Каталог);
	МенеджерIbcmd.ВыгрузитьКонфигурациюВXML(ПараметрыКоманды.Каталог, ПараметрыКоманды.ИмяРасширения);

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
