#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбщий());

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбщий());
	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды, "Ошибка проверки конфигурации");

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	МенеджерIbcmd.ПроверитьКонфигурацию();

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
