#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторЗагрузки());

	Команда.Опция("file f", "",
		"Путь к cfe-файлу расширения (обязательный)")
		.ТСтрока();

	Команда.Опция("name extension n", "",
		"Имя расширения. Если расширения нет в ИБ, оно будет создано (обязательный)")
		.ТСтрока();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторЗагрузки());
	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПараметрыКоманды.Вставить("ПутьКФайлу", ЧтениеОпций.ЗначениеОпции("file", Истина));
	ПараметрыКоманды.Вставить("ИмяРасширения", ЧтениеОпций.ЗначениеОпции("name", Истина));
	РаботаIbcmd.ПроверитьСуществованиеФайла(ПараметрыКоманды.ПутьКФайлу, "--file");

	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды,
		СтрШаблон("Ошибка загрузки расширения %1 из cfe-файла", ПараметрыКоманды.ИмяРасширения));

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	МенеджерIbcmd.ЗагрузитьКонфигурацию(ПараметрыКоманды.ПутьКФайлу, ПараметрыКоманды.ИмяРасширения);
	Если НЕ ПараметрыКоманды.НеОбновлять Тогда
		МенеджерIbcmd.ОбновитьКонфигурациюБД(ПараметрыКоманды.ИмяРасширения,
			ПараметрыКоманды.ДинамическоеОбновление,
			ПараметрыКоманды.ЗавершениеСеансов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
