#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, ПараметрыОпций());

	Команда.Опция("template t", "",
		"Шаблон для создания ИБ: каталог с исходниками XML, cf-файл или dt-файл. "
		+ "Если не указан, будет создана пустая ИБ (необязательный)")
		.ТСтрока();

	Команда.Опция("locale", "",
		"Имя локали информационной базы, например ru_RU (необязательный)")
		.ТСтрока();

	Команда.Опция("sqloffs", "",
		"Смещение дат для Microsoft SQL Server: 0 или 2000 (необязательный)")
		.ТСтрока();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = ПолучитьСтруктуруПараметров(Команда);
	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды, "Ошибка создания информационной базы");

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	МенеджерIbcmd.СоздатьИБ(ПараметрыКоманды.ПутьКШаблону,
		НЕ ПараметрыКоманды.НеОбновлять,
		ПараметрыКоманды.Локаль,
		ПараметрыКоманды.СмещениеДат);

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОпций()

	Результат = РаботаIbcmd.КонструкторСоздания();
	Результат.Добавить("noapply");
	Возврат Результат;

КонецФункции

Функция ПолучитьСтруктуруПараметров(Знач Команда)

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, ПараметрыОпций());

	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПутьКШаблону = ЧтениеОпций.ЗначениеОпции("template");
	Локаль = ЧтениеОпций.ЗначениеОпции("locale");
	СмещениеДатСтрокой = ЧтениеОпций.ЗначениеОпции("sqloffs");

	ПараметрыКоманды.Вставить("ПутьКШаблону", ?(ЗначениеЗаполнено(ПутьКШаблону), ПутьКШаблону, ""));
	ПараметрыКоманды.Вставить("Локаль", ?(ЗначениеЗаполнено(Локаль), Локаль, ""));
	ПараметрыКоманды.Вставить("СмещениеДат", Неопределено);

	Если ЗначениеЗаполнено(СмещениеДатСтрокой) Тогда
		СмещениеДатСтрокой = РаботаIbcmd.ПроверитьЗначениеИзСписка(СмещениеДатСтрокой, "0,2000", "--sqloffs");
		ПараметрыКоманды.СмещениеДат = Число(СмещениеДатСтрокой);
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыКоманды.ПутьКШаблону) Тогда
		Шаблон = Новый Файл(ПараметрыКоманды.ПутьКШаблону);
		Если НЕ Шаблон.Существует() Тогда
			ОбщегоНазначения.ЗавершениеРаботыОшибка("Шаблон ""%1"" (--template) не существует",
				ПараметрыКоманды.ПутьКШаблону);
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыКоманды;

КонецФункции // ПолучитьСтруктуруПараметров()

#КонецОбласти // СлужебныеПроцедурыИФункции
