// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	Команда.ДобавитьКоманду("build",
		"Сборка/обновление информационной базы 1С из проекта EDT (конфигурация или расширение)",
		Новый IbcmdBuild());

	Команда.ДобавитьКоманду("configapply",
		"Обновление конфигурации базы данных",
		Новый IbcmdConfigApply());

	Команда.ДобавитьКоманду("configcheck",
		"Проверка конфигурации 1С",
		Новый IbcmdConfigCheck());

	Команда.ДобавитьКоманду("configload",
		"Загрузить конфигурацию из cf-файла и обновить конфигурацию базы данных",
		Новый IbcmdConfigLoad());

	Команда.ДобавитьКоманду("configloadfromxml",
		"Загрузить конфигурацию из исходников XML (формат 1C) и обновить конфигурацию базы данных",
		Новый IbcmdConfigLoadFromXML());

	Команда.ДобавитьКоманду("configsave",
		"Сохранить конфигурацию в cf-файл",
		Новый IbcmdConfigSave());

	Команда.ДобавитьКоманду("configsavetoxml",
		"Сохранить конфигурацию в исходники XML (формат 1C)",
		Новый IbcmdConfigSaveToXML());

	Команда.ДобавитьКоманду("create",
		"Создание информационной базы 1С: пустой или из шаблона (cf, dt, каталог XML)",
		Новый IbcmdCreate());

	Команда.ДобавитьКоманду("dump",
		"Выгрузка информационной базы 1С в dt-файл",
		Новый IbcmdDump());

	Команда.ДобавитьКоманду("extension",
		"Работа с расширениями 1С",
		Новый IbcmdExtension());

	Команда.ДобавитьКоманду("restore",
		"Загрузка информационной базы 1С из dt-файла",
		Новый IbcmdRestore());

КонецПроцедуры // ОписаниеКоманды()

// Обработчик выполнения команды
//
// Параметры:
//   КомандаПриложения - КомандаПриложения - Выполняемая команда
//
Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт

	КомандаПриложения.ВывестиСправку();

КонецПроцедуры
