// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	Команда.ДобавитьКоманду("delete",
		"Удалить расширение (или все расширения) из информационной базы 1С",
		Новый IbcmdExtensionDelete());

	Команда.ДобавитьКоманду("list",
		"Список расширений информационной базы 1С",
		Новый IbcmdExtensionList());

	Команда.ДобавитьКоманду("load",
		"Загрузить расширение из cfe-файла и обновить его в базе данных",
		Новый IbcmdExtensionLoad());

	Команда.ДобавитьКоманду("loadfromsrc",
		"Загрузить расширение из исходников XML (формат 1C) и обновить его в базе данных",
		Новый IbcmdExtensionLoadFromSrc());

	Команда.ДобавитьКоманду("properties",
		"Изменить свойства расширения (активность, безопасный режим и т.д.)",
		Новый IbcmdExtensionProperties());

	Команда.ДобавитьКоманду("save",
		"Сохранить расширение в cfe-файл",
		Новый IbcmdExtensionSave());

	Команда.ДобавитьКоманду("savetosrc",
		"Сохранить расширение в исходники XML (формат 1C)",
		Новый IbcmdExtensionSaveToSrc());

	Команда.ДобавитьКоманду("update",
		"Обновить расширение в базе данных",
		Новый IbcmdExtensionUpdate());

КонецПроцедуры // ОписаниеКоманды()

// Обработчик выполнения команды
//
// Параметры:
//   КомандаПриложения - КомандаПриложения - Выполняемая команда
//
Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт

	КомандаПриложения.ВывестиСправку();

КонецПроцедуры
