#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбщий());

	Команда.Опция("path to p", "",
		"Каталог, куда сохранить исходники конфигурации в формате XML 1С. "
		+ "Важно! Каталог будет очищен в процессе работы команды (обязательный)")
		.ТСтрока();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = ПолучитьСтруктуруПараметров(Команда);
	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды, "Ошибка выгрузки конфигурации в XML");

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	ФайловыеОперации.ОбеспечитьПустойКаталог(ПараметрыКоманды.Каталог);
	МенеджерIbcmd.ВыгрузитьКонфигурациюВXML(ПараметрыКоманды.Каталог);

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПараметров(Знач Команда)

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбщий());

	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПараметрыКоманды.Вставить("Каталог", ЧтениеОпций.ЗначениеОпции("path", Истина));

	Возврат ПараметрыКоманды;

КонецФункции // ПолучитьСтруктуруПараметров()

#КонецОбласти // СлужебныеПроцедурыИФункции
