#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбщий());

	Команда.Опция("file f", "",
		"Путь к dt-файлу, из которого загрузить информационную базу (обязательный)")
		.ТСтрока();

	Команда.Опция("createdb", "",
		"Создать базу данных в случае отсутствия (необязательный)")
		.ТБулево();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбщий());
	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПараметрыКоманды.Вставить("ПутьКФайлу", ЧтениеОпций.ЗначениеОпции("file", Истина));
	ПараметрыКоманды.Вставить("СоздатьБД", ЧтениеОпций.ЗначениеОпции("createdb") = Истина);
	РаботаIbcmd.ПроверитьСуществованиеФайла(ПараметрыКоманды.ПутьКФайлу, "--file");

	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды, "Ошибка загрузки информационной базы из dt-файла");

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	МенеджерIbcmd.ЗагрузитьДанные(ПараметрыКоманды.ПутьКФайлу, ПараметрыКоманды.СоздатьБД);

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
