#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	РаботаIbcmd.ОписаниеКоманды(Команда, РаботаIbcmd.КонструкторОбновления());

	Команда.Опция("name extension n", "",
		"Имя расширения (обязательный)")
		.ТСтрока();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	ПараметрыКоманды = РаботаIbcmd.ПрочитатьПараметры(Команда, РаботаIbcmd.КонструкторОбновления());
	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ПараметрыКоманды.Вставить("ИмяРасширения", ЧтениеОпций.ЗначениеОпции("name", Истина));

	РаботаIbcmd.ВыполнитьОперацию(ЭтотОбъект, ПараметрыКоманды,
		СтрШаблон("Ошибка обновления расширения %1", ПараметрыКоманды.ИмяРасширения));

КонецПроцедуры // ВыполнитьКоманду()

// Процедура - выполняет операцию с информационной базой
//
// Параметры:
//  МенеджерIbcmd - МенеджерIbcmd - инициализированный менеджер ibcmd
//  ПараметрыКоманды - Структура - параметры команды
//
Процедура ВыполнитьОперацию(Знач МенеджерIbcmd, Знач ПараметрыКоманды) Экспорт

	МенеджерIbcmd.ОбновитьКонфигурациюБД(ПараметрыКоманды.ИмяРасширения,
		ПараметрыКоманды.ДинамическоеОбновление,
		ПараметрыКоманды.ЗавершениеСеансов);

КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
