// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	Команда.ДобавитьКоманду("convert",
		"Конвертировать произвольный файл Markdown в HTML по шаблону оформления",
		Новый MarkdownConvert());

	Команда.ДобавитьКоманду("templates",
		"Вывести список доступных шаблонов для оформления Markdown",
		Новый MarkdownTemplates());

КонецПроцедуры // ОписаниеКоманды()

// Обработчик выполнения команды
//
// Параметры:
//   КомандаПриложения - КомандаПриложения - Выполняемая команда
//
Процедура ВыполнитьКоманду(Знач КомандаПриложения) Экспорт

    КомандаПриложения.ВывестиСправку();

КонецПроцедуры
