#Область ПрограммныйИнтерфейс

// Процедура - устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект описание команды
//
Процедура ОписаниеКоманды(Команда) Экспорт

	Команда.Опция("in i", "",
		"Исходный файл в формате MarkDown, который необходимо сконвертировать")
		.ТСтрока();

	Команда.Опция("out o", "",
		"Файл результата в формате HTML")
		.ТСтрока();

	Текст = "";
	Для Каждого Шаблон Из РаботаСMarkdown.МассивШаблонов() Цикл
		Если НЕ ПустаяСтрока(Текст) Тогда
			Текст = Текст + ", ";
		КонецЕсли;
		Текст = Текст + Шаблон;
	КонецЦикла;
	Команда.Опция("template", "",
		"Шаблон оформления результата. По умолчанию ""Softonit.html"". Доступные шаблоны: "
			+ Текст + " (не обязательный)")
		.ТСтрока();

	Команда.Опция("title", "",
		"Заголовок документа. Если не задан, используется значение опции --productname (необязательный)")
		.ТСтрока();

	Команда.Опция("productname", "",
		"Имя продукта (необязательный)")
		.ТСтрока();

	Команда.Опция("minifyhtml", "",
		"Минимизировать HTML-файл (необязательный)")
		.ТБулево();

	Команда.Опция("maximgwidth", "",
		"Максимальная ширина изображения. "
		+ "Полезна для документов, которые будут отправлены по почте в формате HTML. "
		+ "Всем тегам img будет насильно задана указанная ширина (необязательный)")
		.ТЧисло();

	Команда.Опция("lazyload", "",
		"Использовать ленивую загрузку изображений. "
		+ "Полезна для документов в формате HTML, где много картинок и которые из-за этого будут долго открываться. "
		+ "Всем тегам img будет насильно задан class=""lazyload"" и в head HTML будет встроен скрипт "
		+ "lazysizes.js (необязательный)")
		.ТБулево();

КонецПроцедуры // ОписаниеКоманды()

// Процедура - запускает выполнение команды устанавливает описание команды
//
// Параметры:
//  Команда    - КомандаПриложения     - объект  описание команды
//
Процедура ВыполнитьКоманду(Знач Команда) Экспорт

	Параметры = ПолучитьСтруктуруПараметров(Команда);
	РаботаСMarkdown.Конвертировать(Параметры);

КонецПроцедуры // ВыполнитьКоманду()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруПараметров(Знач Команда)

	ЧтениеОпций = Новый ЧтениеОпцийКоманды(Команда);
	ВыводОтладочнойИнформации = ЧтениеОпций.ЗначениеОпции("verbose");
	ПараметрыСистемы.УстановитьРежимОтладки(ВыводОтладочнойИнформации);

	ПараметрыКоманды = РаботаСMarkdown.КонструкторКонвертирования();
	ПараметрыКоманды.ИсходныйФайл = ЧтениеОпций.ЗначениеОпции("in", Истина);
	ПараметрыКоманды.ФайлРезультат = ЧтениеОпций.ЗначениеОпции("out", Истина);
	ПараметрыКоманды.Заголовок = ЧтениеОпций.ЗначениеОпции("title");
	ПараметрыКоманды.ИмяПродукта = ЧтениеОпций.ЗначениеОпции("productname");
	ПараметрыКоманды.МаксимальнаяШиринаИзображения = ЧтениеОпций.ЗначениеОпции("maximgwidth");

	Шаблон = ЧтениеОпций.ЗначениеОпции("template");
	Если ЗначениеЗаполнено(Шаблон) Тогда
		ПараметрыКоманды.Шаблон = Шаблон;
	КонецЕсли;

	ПараметрыКоманды.ИспользоватьЛенивуюЗагрузку =
		ЗначениеЗаполнено(ЧтениеОпций.ЗначениеОпции("lazyload"));
	ПараметрыКоманды.МинимизироватьHTML =
		ЗначениеЗаполнено(ЧтениеОпций.ЗначениеОпции("minifyhtml"));

	Если НЕ ЗначениеЗаполнено(ПараметрыКоманды.МаксимальнаяШиринаИзображения) Тогда
		ПараметрыКоманды.МаксимальнаяШиринаИзображения = 0;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрыКоманды.Заголовок) Тогда
		ПараметрыКоманды.Заголовок = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрыКоманды.ИмяПродукта) Тогда
		ПараметрыКоманды.ИмяПродукта = "";
	КонецЕсли;

	Возврат ПараметрыКоманды;

КонецФункции // ПолучитьСтруктуруПараметров()

#КонецОбласти // СлужебныеПроцедурыИФункции
